/*
В JavaScript есть 7 основных типов.
number для любых чисел: целочисленных или чисел с плавающей точкой.

string для строк. Строка может содержать один или больше символов, нет отдельного
символьного типа.

boolean для true / false .

null для неизвестных значений – отдельный тип, имеющий одно значение null .

undefined для неприсвоенных значений – отдельный тип, имеющий одно значение
undefined .

object для более сложных структур данных.

symbol для уникальных идентификаторов.
*/

let name = "Ilya";
console.log(`hello ${1}`); // 1
console.log(`hello ${"name"}`); // name
console.log(`hello ${name}`); // Ilya
